### sqlite3 database

In [18]:
import sqlite3

In [19]:
connection = sqlite3.connect('test.db')
cursor = connection.cursor()

## createa a table

In [20]:
cursor.execute('''
            CREATE TABLE IF NOT EXISTS Employees (
                id integer PRIMARY KEY,
                name text NOT NULL,
                age integer,
                department text NOT NULL
            )
''')

# commit the changes
connection.commit()

In [ ]:
## insert data into the table
cursor.execute('''
    INSERT INTO Employees (name, age, department) VALUES
    ('Elon Musk', 52, 'Engineering'),
    ('Bernard Arnault', 75, 'Management'),
    ('Jeff Bezos', 61, 'Operations'),
    ('Mark Zuckerberg', 40, 'Product'),
    ('Larry Ellison', 80, 'Executive'),
    ('Warren Buffett', 94, 'Finance'),
    ('Bill Gates', 69, 'Research'),
    ('Larry Page', 51, 'Technology'),
    ('Sergey Brin', 51, 'Technology'),
    ('Steve Ballmer', 68, 'Sales')
''')
connection.commit()

In [22]:
## qury the data
cursor.execute('SELECT * FROM Employees')
row=cursor.fetchall()

# print the data
for r in row:
    print(r)

(1, 'Elon Musk', 52, 'Engineering')
(2, 'Bernard Arnault', 75, 'Management')
(3, 'Jeff Bezos', 61, 'Operations')
(4, 'Mark Zuckerberg', 40, 'Product')
(5, 'Larry Ellison', 80, 'Executive')
(6, 'Warren Buffett', 94, 'Finance')
(7, 'Bill Gates', 69, 'Research')
(8, 'Larry Page', 51, 'Technology')
(9, 'Sergey Brin', 51, 'Technology')
(10, 'Steve Ballmer', 68, 'Sales')

### update

In [ ]:

cursor.execute('''
	UPDATE Employees
	SET age = 34
	WHERE name = 'Mark Zuckerberg'
	''')
connection.commit()

In [28]:
## qury the data
cursor.execute('SELECT * FROM Employees')
row=cursor.fetchall()

# print the data
for r in row:
    print(r)

(1, 'Elon Musk', 52, 'Engineering')
(2, 'Bernard Arnault', 75, 'Management')
(3, 'Jeff Bezos', 61, 'Operations')
(4, 'Mark Zuckerberg', 34, 'Product')
(5, 'Larry Ellison', 80, 'Executive')
(6, 'Warren Buffett', 94, 'Finance')
(7, 'Bill Gates', 69, 'Research')
(8, 'Larry Page', 51, 'Technology')
(9, 'Sergey Brin', 51, 'Technology')

### delete data from table

In [27]:
cursor.execute('''
DELETE from employees
where name = 'Steve Ballmer'
''')

connection.commit()